local M = {}

-- regex.gsub用のパターン
M.pattern = {}
local P = M.pattern

P.romaji = "nn|-|;|[bcdfghjkmnprstvwxyz]{0,3}[ieaou]" -- ローマ字として解釈できる文字列
P.romaji_rennzoku = "bb@=|cc@=|dd@=|ff@=|gg@=|hh@=|jj@=|kk@=|mm@=|pp@=|rr@=|ss@=|tt@=|vv@=|ww@=|xx@=|yy@=|zz@=|" .. P.romaji -- 上に("tta" -> "った")系を追加したもの
P.kana = "っ|[あ-んゔ][ぇぁぃぅぉゃゅょ]?" -- 仮名として解釈できる文字列 促音は";"のみ対応

-- tbl.fn用のテーブル
M.table = {
    {"nn","ん"},

    {"-","ー"},

    {";","っ"},

    {"a","あ"},
    {"i","い"},
    {"u","う"},
    {"e","え"},
    {"o","お"},

    {"ka","か"},
    {"ki","き"},
    {"ku","く"},
    {"ke","け"},
    {"ko","こ"},

    {"sa","さ"},
    {"si","し"},
    {"su","す"},
    {"se","せ"},
    {"so","そ"},

    {"ta","た"},
    {"ti","ち"},
    {"tu","つ"},
    {"te","て"},
    {"to","と"},

    {"na","な"},
    {"ni","に"},
    {"nu","ぬ"},
    {"ne","ね"},
    {"no","の"},

    {"ha","は"},
    {"hi","ひ"},
    {"hu","ふ"},
    {"he","へ"},
    {"ho","ほ"},

    {"ma","ま"},
    {"mi","み"},
    {"mu","む"},
    {"me","め"},
    {"mo","も"},

    {"ya","や"},
    {"yu","ゆ"},
    {"yo","よ"},

    {"ra","ら"},
    {"ri","り"},
    {"ru","る"},
    {"re","れ"},
    {"ro","ろ"},

    {"wa","わ"},
    {"wo","を"},

    {"ye","いぇ"},

    {"wi","うぃ"},
    {"wu","う"},
    {"we","うぇ"},

    {"ga","が"},
    {"gi","ぎ"},
    {"gu","ぐ"},
    {"ge","げ"},
    {"go","ご"},

    {"za","ざ"},
    {"zi","じ"},
    {"zu","ず"},
    {"ze","ぜ"},
    {"zo","ぞ"},

    {"da","だ"},
    {"di","ぢ"},
    {"du","づ"},
    {"de","で"},
    {"do","ど"},

    {"ba","ば"},
    {"bi","び"},
    {"bu","ぶ"},
    {"be","べ"},
    {"bo","ぼ"},

    {"pa","ぱ"},
    {"pi","ぴ"},
    {"pu","ぷ"},
    {"pe","ぺ"},
    {"po","ぽ"},

    {"kya","きゃ"},
    {"kyi","きぃ"},
    {"kyu","きゅ"},
    {"kye","きぇ"},
    {"kyo","きょ"},

    {"sha","しゃ"},
    {"shi","し"},
    {"shu","しゅ"},
    {"she","しぇ"},
    {"sho","しょ"},

    {"sya","しゃ"},
    {"syi","しぃ"},
    {"syu","しゅ"},
    {"sye","しぇ"},
    {"syo","しょ"},

    {"tya","ちゃ"},
    {"tyi","ちぃ"},
    {"tyu","ちゅ"},
    {"tye","ちぇ"},
    {"tyo","ちょ"},

    {"nya","にゃ"},
    {"nyi","にぃ"},
    {"nyu","にゅ"},
    {"nye","にぇ"},
    {"nyo","にょ"},

    {"hya","ひゃ"},
    {"hyi","ひぃ"},
    {"hyu","ひゅ"},
    {"hye","ひぇ"},
    {"hyo","ひょ"},

    {"fa","ふぁ"},
    {"fi","ふぃ"},
    {"fu","ふ"},
    {"fe","ふぇ"},
    {"fo","ふぉ"},

    {"mya","みゃ"},
    {"myi","みぃ"},
    {"myu","みゅ"},
    {"mye","みぇ"},
    {"myo","みょ"},

    {"rya","りゃ"},
    {"ryi","りぃ"},
    {"ryu","りゅ"},
    {"rye","りぇ"},
    {"ryo","りょ"},

    {"gya","ぎゃ"},
    {"gyi","ぎぃ"},
    {"gyu","ぎゅ"},
    {"gye","ぎぇ"},
    {"gyo","ぎょ"},

    {"ja","じゃ"},
    {"ji","じ"},
    {"ju","じゅ"},
    {"je","じぇ"},
    {"jo","じょ"},

    {"zya","じゃ"},
    {"zyi","じぃ"},
    {"zyu","じゅ"},
    {"zye","じぇ"},
    {"zyo","じょ"},

    {"dya","ぢゃ"},
    {"dyi","ぢぃ"},
    {"dyu","ぢゅ"},
    {"dye","ぢぇ"},
    {"dyo","ぢょ"},

    {"bya","びゃ"},
    {"byi","びぃ"},
    {"byu","びゅ"},
    {"bye","びぇ"},
    {"byo","びょ"},

    {"pya","ぴゃ"},
    {"pyi","ぴぃ"},
    {"pyu","ぴゅ"},
    {"pye","ぴぇ"},
    {"pyo","ぴょ"},

    {"tsa","つぁ"},
    {"tsi","つぃ"},
    {"tsu","つ"},
    {"tse","つぇ"},
    {"tso","つぉ"},

    {"tha","てゃ"},
    {"thi","てぃ"},
    {"thu","てゅ"},
    {"the","てぇ"},
    {"tho","てょ"},

    {"dha","でゃ"},
    {"dhi","でぃ"},
    {"dhu","でゅ"},
    {"dhe","でぇ"},
    {"dho","でょ"},

    {"twa","たぁ"},
    {"twi","てぃ"},
    {"twu","とぅ"},
    {"twe","てぇ"},
    {"two","とぉ"},

    {"dwa","だぁ"},
    {"dwi","でぃ"},
    {"dwu","どぅ"},
    {"dwe","でぇ"},
    {"dwo","どぉ"},

    {"hwa","ふぁ"},
    {"hwi","ふぃ"},
    {"hwu","ふ"},
    {"hwe","ふぇ"},
    {"hwo","ふぉ"},

    {"wha","わ"},
    {"whi","うぃ"},
    {"whu","う"},
    {"whe","うぇ"},
    {"who","うぉ"},

    {"kwa","くぁ"},
    {"kwi","くぃ"},
    {"kwu","く"},
    {"kwe","くぇ"},
    {"kwo","くぉ"},

    {"gwa","ぐぁ"},
    {"gwi","ぐぃ"},
    {"gwu","ぐ"},
    {"gwe","ぐぇ"},
    {"gwo","ぐぉ"},

    {"fya","ふゃ"},
    {"fyi","ふぃ"},
    {"fyu","ふゅ"},
    {"fye","ふぇ"},
    {"fyo","ふょ"},

    {"hwya","ふゃ"},
    {"hwyi","ふぃ"},
    {"hwyu","ふゅ"},
    {"hwye","ふぇ"},
    {"hwyo","ふょ"},

    {"va","ゔぁ"},
    {"vi","ゔぃ"},
    {"vu","ゔ"},
    {"ve","ゔぇ"},
    {"vo","ゔぉ"},

    -- 鼻濁音
    {"xnga","か゚"},
    {"xngi","き゚"},
    {"xngu","く゚"},
    {"xnge","け゚"},
    {"xngo","こ゚"},

    -- 小さいやつ
    {"xtu","っ"},
    {"xtsu","っ"},
    {"xa","ぁ"},
    {"xi","ぃ"},
    {"xu","ぅ"},
    {"xe","ぇ"},
    {"xo","ぉ"},
    {"xya","ゃ"},
    {"xyi","い"},
    {"xyu","ゅ"},
    {"xye","え"},
    {"xyo","ょ"},
    {"xwa","ゎ"},
    {"xwi","ゐ"},
    {"xwu","う"},
    {"xwe","ゑ"},
    {"xwo","を"},
    {"xka","ゕ"},
    {"xke","ゖ"},

    -- 促音追加

    {"b","っ"},
    {"c","っ"},
    {"d","っ"},
    {"f","っ"},
    {"g","っ"},
    {"h","っ"},
    {"j","っ"},
    {"k","っ"},
    {"m","っ"},
    {"p","っ"},
    {"r","っ"},
    {"s","っ"},
    {"t","っ"},
    {"v","っ"},
    {"w","っ"},
    {"x","っ"},
    {"y","っ"},
    {"z","っ"},
}

return M
